import json

crafting_table = [
    # 建筑名                产物名          输入物品名称列表                        输入与输出比例列表  建筑冷却时间
    # Settlement
    ['住房1级',        '人口',   ['水', '苹果', '椅子'],            [1, 1, 1, 24],      50],
    ['住房2级',        '人口',   ['果汁', '面包', '纸', '沙发'],    [1, 1, 1, 1, 108],  50],
    ['住房3级',        '人口',   ['牛奶', '三明治', '书', '高档沙发'], [1, 1, 1, 1, 330],  60],
    ['原住民小屋1级',     '原住民人口',   ['苹果', '石制工具'],            [1, 1, 24],      50],
    ['原住民小屋2级',     '原住民人口', ['木板', '铁制工具', '皮革'], [1, 1, 1, 108], 50],
    ['原住民小屋3级',     '原住民人口', ['玻璃', '肉', '钢制工具'], [1, 1, 1, 330], 60],
    # 水
    ['水井',          '水',        [],                                     [1],                7],
    ['水泵',          '水',        ['面包'],                              [1, 3],             5],
    ['海水过滤器',    '水',        ['煤炭'],                               [1, 2],             20],
    # Food
    ['苹果农场',          '苹果',        ['水'],                              [1, 2],             10],
    ['果汁厂',         '果汁',        ['木板', '苹果'],                     [1, 1, 2],          15],
    ['小麦农场',          '小麦',        ['水'],                              [1, 2],             10],
    ['面包坊',              '面包',        ['小麦', '煤炭'],                      [2, 1, 2],          20],
    ['奶牛农场',            '奶牛',          ['水', '小麦'],                     [1, 1, 2],          15],
    ['牛奶工厂',        '牛奶',         ['奶牛', '玻璃'],                       [1, 1, 2],          20],
    ['屠宰场',             '肉',         ['奶牛', '铁制工具'],                   [1, 1, 2],          20],
    ['餐厅',          '三明治',     ['面包', '肉'],                      [1, 1, 2],          20],
    # Wood Work
    ['伐木场',         '原木',       ['苹果', '树'],                      [1, 1, 1],          15],
    ['锯木厂',             '圆木',          ['原木'],                             [1, 2],             10],
    ['林场',            '树',         ['水'],                              [1, 1],             10],
    ['木匠工坊',  '木板',        ['圆木', '石制工具'],                  [1, 1, 2],          25],
    ['制炭厂',      '煤炭',         ['苹果', '原木'],                    [1, 1, 2],          15],
    ['木材工厂',        '圆木',          ['面包', '树'],                      [1, 1, 2],          20],
    ['木梁工坊',  '木梁',    ['铁制工具', '木板'],                 [1, 1, 2],          40],
    # Ores
    ['采石厂',        '石头',        ['苹果'],                              [1, 2],             20],
    ['石矿',          '石头',        ['面包'],                              [1, 3],             10],
    ['采煤厂',         '煤炭',         ['苹果'],                              [1, 2],             20],
    ['煤矿',           '煤炭',         ['面包'],                              [1, 3],             10],
    ['采铁厂',         '铁矿石',     ['面包'],                              [1, 2],             20],
    ['铁矿',           '铁矿石',     ['面包'],                              [1, 3],             10],
    ['集沙厂',      '沙子',         ['果汁'],                              [1, 1],             20],
    ['钻石矿',        '钻石',      ['肉', '钢制工具'],                 [1, 1, 3],          10],
    # Tools
    ['石制工具厂',    '石制工具',   ['石头', '圆木'],                       [1, 1, 2],          7],
    ['铁制工具厂',     '铁制工具',    ['铁', '石制工具'],                 [1, 1, 2],          10],
    ['钢制工具厂',    '钢制工具',   ['钢', '铁制工具'],                 [1, 1, 2],          15],
    # Furniture
    ['木质家具厂',    '椅子',    ['原木', '石制工具'],               [1, 1, 2],          15],
    ['皮革家具厂', '沙发',     ['皮革', '椅子'],                   [1, 1, 1],          15],
    ['高档家具厂',  '高档沙发',   ['钻石', '沙发'],                    [1, 1, 1],          25],
    # Factories
    ['石材厂',       '石材',  ['石头', '石制工具'],                [1, 1, 2],          25],
    ['石材加工厂',       '石砖',        ['铁制工具', '石材'],           [1, 1, 2],          40],
    ['炼铁厂',        '铁',         ['煤炭', '铁矿石'],                   [1, 2, 2],          15],
    ['造纸厂',       '纸',        ['圆木', '铁制工具'],                   [1, 1, 2],          30],
    ['皮革厂',       '皮革',      ['奶牛', '铁制工具'],                   [1, 1, 2],          20],
    ['玻璃厂',         '玻璃',        ['沙子', '煤炭'],                       [1, 1, 2],          25],
    ['炼钢厂',       '钢',        ['煤炭', '铁'],                       [1, 1, 1],          20],
    ['图书馆',             '书',         ['皮革', '纸', '钢制工具'],     [1, 1, 1, 2],       25],
]


with open('buildings_zh.json', 'w') as file:
    json.dump(crafting_table, file)